import { px2 } from '@/utils/viewport';
import { status } from 'nprogress';

export default {

  data() {

    return {

      tableData: [
        {
          index: '港口作业',
          data: [
            {
              value: '船舶在港作业数',
              current: '18艘',
              status: '正常'
            },
             {
              value: '码头作业效率',
              current: '85%',
              status: '正常'
            },{
              value: '闸口小时通过量',
              current: '120辆',
              status: '🔴下降'
            },
          ]
        },
         {
          index: '公路运输',
          data: [
            {
              value: '疏港高速平均速度',
              current: '45 km/h',
              status: '🟡缓慢'
            },
             {
              value: '主要拥堵点数量',
              current: '3处',
              status: '🔴预警'
            },{
              value: '受影响集卡预估',
              current: '150辆',
              status: '🔴预警'
            },
          ]
        },
         {
          index: '气象环境',
          data: [
            {
              value: '港区能见度',
              current: '2.1 km',
              status: '🟡注意'
            },
             {
              value: '最大风速',
              current: '7.2级',
              status: '🟡注意'
            },{
              value: '1小时降雨量',
              current: '5.4 mm',
              status: '🟡注意'
            },
          ]
        }
      ],

      // 风力数据
      windPowerTable: [
        {
          area: '江阴港区',
          windSpeed: '东北风6-7级（10.8-17.1m/s）',
          realTime: '8-9级（17.2-24.4m/s）',
          visibility: '8-10km',
          weather: '多云',
          warn: '大风黄色预警（持续至20日20:22）',
        },
        {
          area: '马尾港区',
          windSpeed: '东北风6-7级（10.8-17.1m/s）',
          realTime: '8-9级（17.2-24.4m/s）',
          visibility: '6-8km',
          weather: '多云',
          warn: '大风黄色预警（持续至20日20:22）',
        },
        {
          area: '松下港区',
          windSpeed: '东北风6-7级（10.8-17.1m/s）',
          realTime: '8-9级（17.2-24.4m/s）',
          visibility: '7-9km',
          weather: '多云',
          warn: '大风黄色预警（持续至20日20:22）',
        },
        {
          area: '可门港区',
          windSpeed: '东北风6-7级（10.8-17.1m/s）',
          realTime: '8-9级（17.2-24.4m/s）',
          visibility: '7-9km',
          weather: '多云',
          warn: '大风黄色预警（持续至20日20:22）',
        }
      ],

      // 船舶数量
      shipsTable: [
        {
          type: '在岗作业船舶',
          number: '18',
          distribution: '集装箱船6艘、散货船5艘、油化船4艘、其他辅助船3艘',
          region: '江阴港区（8艘）、马尾港区（5艘）、可门港区（3艘）、松下港区（2艘）',
        },
         {
          type: '锚地待泊船舶',
          number: '12',
          distribution: '散货船4艘、集装箱船3艘、油化船3艘、杂货船2艘',
          region: '江阴锚地（5艘）、罗源湾锚地（4艘）、闽江口锚地（3艘）',
        },
         {
          type: '合计（在港+待泊）',
          number: '30',
          distribution: '-',
          region: '各港区及对应锚地均衡分布',
        },
      ]
    }
  }
}
