export default {
  data() {
    return {
      // 高速公路
      highwayMonitor: {
        current: 30,
        next: '+2',
        color: '#BF0000',
        level: '红色',
        levelName: '最高预警等级',
        infos: [
          {
            type: '严重拥堵',
            datetime: '2026-01-06 12:59:23',
            reason: '车流量大',
            description: '1月6日11时22分，因短时间车流密度极速提升，G25长深高速公路K41+400一K0+500深圳方向车流密度大，议去往深圳方向的车辆走行其他路线绕行，预计1月6日晚恢复正常。',
            data: [
              {
                name: '路段名称：',
                value: 'K101-K105泉州南安水头路段'
              },
              {
                name: '所属高速：',
                value: 'G25沈海高速'
              },
              {
                name: '拥堵长度：',
                value: '6公里'
              },
              {
                name: '预计恢复时间：',
                value: '12时50分'
              }
            ]
          },
          {
            type: '交通事故',
            datetime: ' 2026-01-06 12:59:23',
            reason: '交通事故',
            description: '1月6日10时02分，因连环交通事故，出现严重拥堵，拥堵路段从 （闽侯半山隧道） 延伸至 （宁德古田排头枢纽），拥堵长度约 （10）公里，预计拥堵持续 （2）小时，建议车辆绕行。',
            data: [
              {
                name: '路段名称：',
                value: '闽侯半山隧道至宁德古田排头枢纽路段'
              },
              {
                name: '所属高速：',
                value: '京台高速'
              },
              {
                name: '拥堵长度：',
                value: '6公里'
              }
            ]
          }
        ]
      },

      // 普通公路
      roadMonitor: {
        current: 120,
        next: '+5',
        color: '#BF0000',
        level: '红色',
        levelName: '最高预警等级',
        infos: [
          {
            type: '严重拥堵',
            datetime: '2026-01-06 12:59:23',
            reason: '地质灾害',
            description: '1月6日11时22分，因地质灾害治理封闭施工，大量车辆绕行至长乐松下至福清元洪段，造成该路段车流激增、严重拥堵，拥堵长度约 （3）公里，预计拥堵持续 （30）分钟，建议车辆绕行。',
            data: [
              {
                name: '拥堵位置：',
                value: '长乐松下至福清元洪段'
              },
              {
                name: '路线编号：',
                value: '国道G228线'
              },
              {
                name: '拥堵长度：',
                value: '6公里'
              },
              {
                name: '预计恢复时间：',
                value: '13时20分'
              }
            ]
          },
          {
            type: '严重拥堵',
            datetime: ' 2026-01-06 12:59:23',
            reason: '道路施工',
            description: '1月6日11时22分，因地质灾害治理封闭施工，请长乐松下至福清元洪段车辆绕行，预计通车时间1月7日04:00。',
            data: [
              {
                name: '路段名称：',
                value: '长乐松下至福清元洪段'
              },
              {
                name: '所属道路：',
                value: '国道G228线'
              },
              {
                name: '拥堵长度：',
                value: '3公里'
              }
            ]
          }
        ]
      },

      // 水运港口预警动态监测
      portMonitor: {
        current: 30,
        next: '+2',
        color: '#FFE47D ',
        level: '黄色',
        levelName: '最高预警等级',
        infos: [
          {
            type: '航道堵塞',
            datetime: '2026-01-06 12:59:23',
            reason: '地质灾害',
            description: '1月6日11时22分，因地质灾害治理封闭施工，大量车辆绕行至长乐松下至福清元洪段，造成该路段车流激增、严重拥堵，拥堵长度约 （3）公里，预计拥堵持续 （30）分钟，建议车辆绕行。',
            data: [
              {
                name: '堵塞位置：',
                value: '闽江通海航道外沙航段'
              },
              {
                name: '所属航道：',
                value: '福州港闽江通海航道'
              },
              {
                name: '拥堵长度：',
                value: '8公里'
              },
              {
                name: '影响船舶：',
                value: '40艘'
              }
            ]
          },
          {
            type: '港口关闭',
            datetime: ' 2026-01-06 12:59:23',
            reason: '恶劣天气',
            description: '超强台风 “格美” 将于 1月 25 日下午在福建沿海登陆，风力达 14-16 级，伴有巨浪。预计 1 月 24 日 16:30 起封港，1 月 26 日 08:00 恢复，时长约 39.5 小时',
            data: [
              {
                name: '所属港口：',
                value: '厦门港'
              },
              {
                name: '关闭时间：',
                value: '1 月 24 日 16:30 ～1 月 26 日 08:00'
              },
              {
                name: '影响航道/船舶：',
                value: '厦金航线全线停航、国际邮轮中心所有船舶离港避风'
              }
            ]
          }
        ]
      }
    }
  }
}
